MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer4_oco.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_timer4_oco.c
 **
 ** A detailed description is available at
 ** @link Timer4OcoGroup Timer4OCO description @endlink
 **
 **   - 2018-11-02  1.0 Hongjh First version for Device Driver Library of
 **                     Timer4OCO.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_timer4_oco.h"
#include "hc32f46x_utility.h"

#if (DDL_TIMER4_OCO_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer4OcoGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter validity check for Timer4 unit  */
#define IS_VALID_TIMER4(__TMRx__) \
    ((M4_TMR41 == (__TMRx__)) ||  \
     (M4_TMR42 == (__TMRx__)) ||  \
     (M4_TMR43 == (__TMRx__)))

/*!< Parameter validity check for oco channel  */
#define IS_VALID_OCO_CH(x)    \
    ((Timer4OcoOuh == (x)) || \
     (Timer4OcoOul == (x)) || \
     (Timer4OcoOvh == (x)) || \
     (Timer4OcoOvl == (x)) || \
     (Timer4OcoOwh == (x)) || \
     (Timer4OcoOwl == (x)))

/*!< Parameter validity check for oco low channel  */
#define IS_VALID_OCO_LOW_CH(x) \
    ((Timer4OcoOul == (x)) ||  \
     (Timer4OcoOvl == (x)) ||  \
     (Timer4OcoOwl == (x)))

/*!< Parameter validity check for even high channel  */
#define IS_VALID_OCO_HIGH_CH(x) \
    ((Timer4OcoOuh == (x)) ||   \
     (Timer4OcoOvh == (x)) ||   \
     (Timer4OcoOwh == (x)))

/*!< Parameter validity check for occr buffer mode  */
#define IS_VALID_OCCR_BUF_MODE(x)              \
    ((OccrBufDisable == (x)) ||                \
     (OccrBufTrsfByCntZero == (x)) ||          \
     (OccrBufTrsfByCntPeak == (x)) ||          \
     (OccrBufTrsfByCntZeroOrCntPeak == (x)) || \
     (OccrBufTrsfByCntZeroZicZero == (x)) ||   \
     (OccrBufTrsfByCntPeakPicZero == (x)) ||   \
     (OccrBufTrsfByCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for ocmr buffer mode  */
#define IS_VALID_OCMR_BUF_MODE(x)              \
    ((OcmrBufDisable == (x)) ||                \
     (OcmrBufTrsfByCntZero == (x)) ||          \
     (OcmrBufTrsfByCntPeak == (x)) ||          \
     (OcmrBufTrsfByCntZeroOrCntPeak == (x)) || \
     (OcmrBufTrsfByCntZeroZicZero == (x)) ||   \
     (OcmrBufTrsfByCntPeakPicZero == (x)) ||   \
     (OcmrBufTrsfByCntZeroZicZeroOrCntPeakPicZero == (x)))

/*!< Parameter validity check for output level type  */
#define IS_VALID_OP_PORT_LEVEL(x) \
    ((OcPortLevelLow == (x)) ||   \
     (OcPortLevelHigh == (x)))

/*!< Parameter validity check for oco OP state  */
#define IS_VALID_OP_STATE(x)     \
    ((OcoOpOutputLow == (x)) ||  \
     (OcoOpOutputHigh == (x)) || \
     (OcoOpOutputHold == (x)) || \
     (OcoOpOutputReverse == (x)))

/*!< Parameter validity check for oco OCF state  */
#define IS_VALID_OCF_STATE(x) \
    ((OcoOcfSet == (x)) ||    \
     (OcoOcfHold == (x)))

/*!< Get the specified register address of the specified Timer4 unit */
#define TMR4_OCCRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->OCCRUH + ((uint32_t)(__CH__)) * 4ul)
#define TMR4_OCMRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->OCMRHUH + ((uint32_t)(__CH__)) * 4ul)
#define TMR4_OCERx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->OCERU + (((uint32_t)(__CH__)) / 2ul) * 4ul)
#define TMR4_OCSRx(__TMR4x__, __CH__) ((uint32_t) & (__TMR4x__)->OCSRU + (((uint32_t)(__CH__)) / 2ul) * 4ul)

