MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer4_oco.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Initialize OCO module
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of OCO
 ** \arg Timer4OcoOuh                   Timer oco channel:OUH
 ** \arg Timer4OcoOul                   Timer oco channel:OUL
 ** \arg Timer4OcoOvh                   Timer oco channel:OVH
 ** \arg Timer4OcoOvl                   Timer oco channel:OVL
 ** \arg Timer4OcoOwh                   Timer oco channel:OWH
 ** \arg Timer4OcoOwl                   Timer oco channel:OWL
 ** \param [in] pstcInitCfg             The pointer of OCO configure structure
 ** \arg This parameter detail refer @ref stc_timer4_oco_init_t
 **
 ** \retval Ok                          Initialize successfully
 ** \retval ErrorInvalidParameter If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - pstcInitCfg == NULL
 **                                     - enCh is invalid
 **                                     - Other invalid configuration
 **
 ******************************************************************************/
en_result_t TIMER4_OCO_Init(M4_TMR4_TypeDef *TMR4x,
                            en_timer4_oco_ch_t enCh,
                            const stc_timer4_oco_init_t *pstcInitCfg)
{
    __IO stc_tmr4_ocsr_field_t *pstcOCSR = NULL;
    __IO stc_tmr4_ocer_field_t *pstcOCER = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x && pstcInitCfg pointer */
    if ((IS_VALID_TIMER4(TMR4x)) && (NULL != pstcInitCfg))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_OCO_CH(enCh));
        DDL_ASSERT(IS_VALID_TIMER4(TMR4x));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enOcoIntCmd));
        DDL_ASSERT(IS_VALID_OP_PORT_LEVEL(pstcInitCfg->enPortLevel));
        DDL_ASSERT(IS_VALID_OCMR_BUF_MODE(pstcInitCfg->enOcmrBufMode));
        DDL_ASSERT(IS_VALID_OCCR_BUF_MODE(pstcInitCfg->enOccrBufMode));

        enRet = Ok;
        /* Get pointer of current channel OCO register address */
        pstcOCER = (__IO stc_tmr4_ocer_field_t *)TMR4_OCERx(TMR4x, enCh);
        pstcOCSR = (__IO stc_tmr4_ocsr_field_t *)TMR4_OCSRx(TMR4x, enCh);

        /* Set OCMR and OCCR buffer mode */
        if (IS_VALID_OCO_HIGH_CH(enCh)) /* channel: Timer4OcoOuh, Timer4OcoOvh, Timer4OcoOwh */
        {
            pstcOCSR->OCEH = (uint16_t)0u;
            pstcOCSR->OCFH = (uint16_t)0u;

            /* OCMR buffer */
            switch (pstcInitCfg->enOcmrBufMode)
            {
            case OcmrBufDisable:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)0u;
                break;
            case OcmrBufTrsfByCntZero:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeak:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroOrCntPeak:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)3u;
                break;
            case OcmrBufTrsfByCntZeroZicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeakPicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroZicZeroOrCntPeakPicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)3u;
                break;
            default:
                enRet = ErrorInvalidParameter;
                break;
            }

            if (enRet == Ok)
            {
                /* OCCR buffer */
                switch (pstcInitCfg->enOccrBufMode)
                {
                case OccrBufDisable:
                    pstcOCER->LMCH = (uint16_t)0u;
                    pstcOCER->CHBUFEN = (uint16_t)0u;
                    break;
                case OccrBufTrsfByCntZero:
                    pstcOCER->LMCH = (uint16_t)0u;
                    pstcOCER->CHBUFEN = (uint16_t)1u;
                    break;
                case OccrBufTrsfByCntPeak:
                    pstcOCER->LMCH = (uint16_t)0u;
                    pstcOCER->CHBUFEN = (uint16_t)2u;
                    break;
                case OccrBufTrsfByCntZeroOrCntPeak:
                    pstcOCER->LMCH = (uint16_t)0u;
                    pstcOCER->CHBUFEN = (uint16_t)3u;
                    break;
                case OccrBufTrsfByCntZeroZicZero:
                    pstcOCER->LMCH = (uint16_t)1u;
                    pstcOCER->CHBUFEN = (uint16_t)1u;
                    break;
                case OccrBufTrsfByCntPeakPicZero:
                    pstcOCER->LMCH = (uint16_t)1u;
                    pstcOCER->CHBUFEN = (uint16_t)2u;
                    break;
                case OccrBufTrsfByCntZeroZicZeroOrCntPeakPicZero:
                    pstcOCER->LMCH = (uint16_t)1u;
                    pstcOCER->CHBUFEN = (uint16_t)3u;
                    break;
                default:
                    enRet = ErrorInvalidParameter;
                    break;
                }
            }

