MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer4_oco.c
        enRet = Ok;
        /* Get pointer of current channel OCO register address */
        pstcOCER = (__IO stc_tmr4_ocer_field_t *)TMR4_OCERx(TMR4x, enCh);

        /* Set OCMR buffer mode */
        if (IS_VALID_OCO_HIGH_CH(enCh)) /* channel: Timer4OcoOuh, Timer4OcoOvh, Timer4OcoOwh */
        {
            /* OCMR buffer */
            switch (enOcmrBufMode)
            {
            case OcmrBufDisable:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)0u;
                break;
            case OcmrBufTrsfByCntZero:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeak:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroOrCntPeak:
                pstcOCER->LMMH = (uint16_t)0u;
                pstcOCER->MHBUFEN = (uint16_t)3u;
                break;
            case OcmrBufTrsfByCntZeroZicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeakPicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroZicZeroOrCntPeakPicZero:
                pstcOCER->LMMH = (uint16_t)1u;
                pstcOCER->MHBUFEN = (uint16_t)3u;
                break;
            default:
                enRet = ErrorInvalidParameter;
                break;
            }
        }
        else if (IS_VALID_OCO_LOW_CH(enCh)) /* channel: Timer4OcoOul, Timer4OcoOvl, Timer4OcoOwl */
        {
            /* OCMR buffer */
            switch (enOcmrBufMode)
            {
            case OcmrBufDisable:
                pstcOCER->LMML = (uint16_t)0u;
                pstcOCER->MLBUFEN = (uint16_t)0u;
                break;
            case OcmrBufTrsfByCntZero:
                pstcOCER->LMML = (uint16_t)0u;
                pstcOCER->MLBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeak:
                pstcOCER->LMML = (uint16_t)0u;
                pstcOCER->MLBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroOrCntPeak:
                pstcOCER->LMML = (uint16_t)0u;
                pstcOCER->MLBUFEN = (uint16_t)3u;
                break;
            case OcmrBufTrsfByCntZeroZicZero:
                pstcOCER->LMML = (uint16_t)1u;
                pstcOCER->MLBUFEN = (uint16_t)1u;
                break;
            case OcmrBufTrsfByCntPeakPicZero:
                pstcOCER->LMML = (uint16_t)1u;
                pstcOCER->MLBUFEN = (uint16_t)2u;
                break;
            case OcmrBufTrsfByCntZeroZicZeroOrCntPeakPicZero:
                pstcOCER->LMML = (uint16_t)1u;
                pstcOCER->MLBUFEN = (uint16_t)3u;
                break;
            default:
                enRet = ErrorInvalidParameter;
                break;
            }
        }
        else
        {
            enRet = ErrorInvalidParameter;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Extend the matching determination conditions of OCO channel
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of OCO
 ** \arg Timer4OcoOuh                   Timer oco channel:OUH
 ** \arg Timer4OcoOul                   Timer oco channel:OUL
 ** \arg Timer4OcoOvh                   Timer oco channel:OVH
 ** \arg Timer4OcoOvl                   Timer oco channel:OVL
 ** \arg Timer4OcoOwh                   Timer oco channel:OWH
 ** \arg Timer4OcoOwl                   Timer oco channel:OWL
 ** \param [in] enCmd                   Extend the match conditions functional state
 ** \arg Enable                         Extend the match conditions function
 ** \arg Disable                        Don't extend the match conditions function
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_OCO_ExtMatchCondCmd(M4_TMR4_TypeDef *TMR4x,
                                       en_timer4_oco_ch_t enCh,
                                       en_functional_state_t enCmd)
{
    __IO stc_tmr4_ocer_field_t *pstcOCER = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_OCO_CH(enCh));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enCmd));

        /* Get pointer of current channel OCO register address  */
        pstcOCER = (__IO stc_tmr4_ocer_field_t *)TMR4_OCERx(TMR4x, enCh);
        IS_VALID_OCO_HIGH_CH(enCh) ? (pstcOCER->MCECH = (uint16_t)enCmd) : (pstcOCER->MCECL = (uint16_t)enCmd);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set compare mode of OCO high channel
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of OCO
 ** \arg Timer4OcoOuh                   Timer oco channel:OUH
 ** \arg Timer4OcoOul                   Timer oco channel:OUL
 ** \arg Timer4OcoOvh                   Timer oco channel:OVH
 ** \arg Timer4OcoOvl                   Timer oco channel:OVL
 ** \arg Timer4OcoOwh                   Timer oco channel:OWH
 ** \arg Timer4OcoOwl                   Timer oco channel:OWL
 ** \param [in] pstcMode                pointer to structure of compare mode
 ** \arg This parameter detail refer @ref stc_oco_high_ch_compare_mode_t
 **
 ** \retval Ok                          OCO high channel compare mode is set successfully.
 ** \retval ErrorInvalidParameter       If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - pstcMode pointer is NULL
 **
 ******************************************************************************/
en_result_t TIMER4_OCO_SetHighChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                            en_timer4_oco_ch_t enCh,
                                            const stc_oco_high_ch_compare_mode_t *pstcMode)
{
    uint16_t u16OCMR = 0u;
    __IO uint16_t *pu16OCMR = NULL;
    __IO stc_tmr4_ocer_field_t *pstcOCER = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x && pstcMode pointer */
    if ((IS_VALID_TIMER4(TMR4x)) && (NULL != pstcMode))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_OCO_HIGH_CH(enCh));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntZeroMatchOpState));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntZeroNotMatchOpState));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntUpCntMatchOpState));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntPeakMatchOpState));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntPeakNotMatchOpState));
        DDL_ASSERT(IS_VALID_OP_STATE(pstcMode->enCntDownCntMatchOpState));
        DDL_ASSERT(IS_VALID_OCF_STATE(pstcMode->enCntZeroMatchOcfState));
        DDL_ASSERT(IS_VALID_OCF_STATE(pstcMode->enCntUpCntMatchOcfState));
        DDL_ASSERT(IS_VALID_OCF_STATE(pstcMode->enCntPeakMatchOcfState));
        DDL_ASSERT(IS_VALID_OCF_STATE(pstcMode->enCntDownCntMatchOcfState));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcMode->enMatchConditionExtendCmd));

        /* Get pointer of current channel OCO register address */
        pu16OCMR = (__IO uint16_t *)TMR4_OCMRx(TMR4x, enCh);
        pstcOCER = (__IO stc_tmr4_ocer_field_t *)TMR4_OCERx(TMR4x, enCh);

        pstcOCER->MCECH = (uint16_t)(pstcMode->enMatchConditionExtendCmd);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntZeroMatchOpState << 10u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntZeroNotMatchOpState << 14u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntUpCntMatchOpState << 8u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntPeakMatchOpState << 6u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntPeakNotMatchOpState << 12u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntDownCntMatchOpState << 4u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntZeroMatchOcfState << 3u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntUpCntMatchOcfState << 2u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntPeakMatchOcfState << 1u);
        u16OCMR |= (uint16_t)((uint16_t)pstcMode->enCntDownCntMatchOcfState << 0u);

        *pu16OCMR = u16OCMR;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set compare mode of OCO low channel
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of OCO
 ** \arg Timer4OcoOuh                   Timer oco channel:OUH
 ** \arg Timer4OcoOul                   Timer oco channel:OUL
 ** \arg Timer4OcoOvh                   Timer oco channel:OVH
 ** \arg Timer4OcoOvl                   Timer oco channel:OVL
 ** \arg Timer4OcoOwh                   Timer oco channel:OWH
 ** \arg Timer4OcoOwl                   Timer oco channel:OWL
 ** \param [in] pstcMode                pointer to structure of compare mode
 ** \arg This parameter detail refer @ref TIMER4_OCO_SetLowChCompareMode
 **
 ** \retval Ok                          OCO low channel compare mode is set successfully.
 ** \retval ErrorInvalidParameter       If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - pstcMode pointer is NULL
 **
 ******************************************************************************/
en_result_t TIMER4_OCO_SetLowChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                           en_timer4_oco_ch_t enCh,
                                           const stc_oco_low_ch_compare_mode_t *pstcMode)
{
    uint32_t u32OCMR = 0ul;
    __IO uint32_t *pu32OCMR = NULL;
    __IO stc_tmr4_ocer_field_t *pstcOCER = NULL;
    en_result_t enRet = ErrorInvalidParameter;

